In [7]:
import sqlite3
import pandas as pd

con = sqlite3.connect("db")

student = pd.read_sql("SELECT * FROM Student", con, index_col=None)
student

    name  grade phone_number
0  louis      3  01012345678
1    bob      2  01012345678
2  nancy      2  01012345678

In [8]:
score = pd.read_sql("SELECT * FROM Score", con, index_col=None)
score

    name  score
0  louis     95
1    bob    100

In [9]:
pd.merge(student, score, left_on="name", right_on="name", how="left")

    name  grade phone_number  score
0  louis      3  01012345678   95.0
1    bob      2  01012345678  100.0
2  nancy      2  01012345678    NaN

In [12]:
pd.merge(score, student, left_on="name", right_on="name", how="inner")

    name  score  grade phone_number
0  louis     95      3  01012345678
1    bob    100      2  01012345678